load files="csv params io gui render-params df scene-explorer-3d misc svg";

screen auto_activate {
  text text="Hello";

  свггруппа занять_родителя {
    штука1: 
       абстракция_номер_2;

    абстракция_номер_2 {{ 
      справа от=@штука1; 
    }};

    svg tag="circle" dom_cx=50 dom_cy=50 dom_r=30 dom_fill="red" dom_stroke="blue" dom_stroke-width="5";           

    /*
    svg tag="rect" dom_x=50 dom_y=50 dom_width=30 dom_height=120 
           dom_fill="red" dom_stroke="blue" dom_stroke-width="5";
    */           
  };

};


debugger_screen_r;

//новое имя="абстракция_номер_2" {
register_feature name="абстракция_номер_2" {  
  свггруппа подсчет_размеров {
    абстракция_номер_1 икс=0 игрек=0 {{ 
      сверху от=@кмал; 
      горизонталь как=@кмал; 
    }};
    кмал: квадрат_малевича икс=100 игрек=100 ширина=300;    
  };
};

register_feature name="абстракция_номер_1" {
 свггруппа подсчет_размеров {
    круг1: круг   цвет="зеленый" 
                  контур="orange"
                    ширина_контура=5
                  центр_икс=50
                  центр_игрек=130
                  радиус=30
                  ;

    п1: прямоугольник цвет="голубой" ширина=150 высота=10 цвет_контура="серый"
        {{ справа от=@круг1; 
           вертикаль как=@круг1; 
        }};

    круг цвет="#f5f5dc" радиус=15 {{ справа от=@п1; вертикаль как=@п1; }};

      //круг цвет="черный" радиус=5 {{ вертикаль как=}}

    квадрат ширина=50 {{ снизу от=@п1; горизонталь как=@п1; }};
  }
};

/// квадрат_малевича
register_feature name="квадрат_малевича" {
  гр: свггруппа высота=@.->ширина {
    квчер: квадрат цвет="черный" ширина="100%" высота="100%" {{
      clicked {
        setter target="@квчер->цвет" value="синий";
      };
    }};;
    квбел: квадрат цвет="белый" ширина="40%" икс="40%" игрек="40%" {{
      clicked {
        setter target="@квбел->цвет" value="красный";
      };
    }};
  };
};

/*
register_feature name="круг-с-глазом" {
   env {
      кр1: круг;
      круг цвет="черный" {{ вертикаль как=@кр1; горизонталь как=@кр1; }}
   }
}
*/

register_feature name="глазик" {
   родитель: {
      круг цвет="черный" {{ вертикаль как=@родитель; горизонталь как=@родитель; }}
   };
};


